etc/diamond-configs/diamond-init.org
#+TITLE: Diamond Init Enviroment
#+PROPERTY: header-args :tangle ../../init.el
#+auto_tangle: t
#+STARTUP: showeverything
#+AUTHOR: Pietro Visconti

#+BEGIN_SRC elisp

  ;; Diamond Emacs for Mac
  ;;
  ;; Visco01 config started in 2022

#+END_SRC

#+BEGIN_SRC elisp

  (require 'package)

  (add-to-list 'package-archives
               '("org" . "https://orgmode.org/elpa/") t)
  (add-to-list 'package-archives
               '("melpa" . "http://melpa.org/packages/") t)

  (setq package-enable-at-startup nil)
  (package-initialize)

  (unless (package-installed-p 'use-package)
   (package-refresh-contents)
   (package-install 'use-package))

  (eval-when-compile
   (require 'use-package))

#+END_SRC

* File loaded

** Packages config file

#+BEGIN_SRC elisp

  (setq packages "~/.emacs.d/packages.el")
  (load-file packages)

#+END_SRC

** Customization config file

#+BEGIN_SRC elisp

  (setq customisation "~/.emacs.d/custom.el")
  (load-file customisation)

#+END_SRC

** Mode config file

#+BEGIN_SRC elisp

  (setq modalities "~/.emacs.d/mode.el")
  (load-file modalities)

#+END_SRC
